NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32BG21/EFR32BG21A020F1024IM32.svd
        <register>
          <name>R6</name>
          <description>No Description</description>
          <addressOffset>0x04C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>R6</name>
              <description>Sequencer Register 6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>R7</name>
          <description>No Description</description>
          <addressOffset>0x050</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>R7</name>
              <description>Sequencer Register 7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WAITMASK</name>
          <description>No Description</description>
          <addressOffset>0x054</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000001FF</resetMask>
          <fields>
            <field>
              <name>STCMP</name>
              <description>STIMER Compare Event</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FRCRX</name>
              <description>FRC RXWord</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FRCTX</name>
              <description>FRC TXWord</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PRSEVENT</name>
              <description>PRS Event</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DEMODRXREQCLR</name>
              <description>Demodulator RX Request Clear</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SYNTHRDY</name>
              <description>SYNTH Ready</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RAMPDONE</name>
              <description>Ramp Done</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FRCPAUSED</name>
              <description>FRC Paused</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ANTSWITCH</name>
              <description>Active antenna has switched</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WAITSNSH</name>
          <description>No Description</description>
          <addressOffset>0x058</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000003FF</resetMask>
          <fields>
            <field>
              <name>WAITSNSH</name>
              <description>Wait Event Snapshot</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIMER</name>
          <description>No Description</description>
          <addressOffset>0x05C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>STIMER</name>
              <description>STIMER Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIMERCOMP</name>
          <description>No Description</description>
          <addressOffset>0x060</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>STIMERCOMP</name>
              <description>STIMER Compare Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VECTADDR</name>
          <description>No Description</description>
          <addressOffset>0x064</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VECTADDR</name>
              <description>Vector Table Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEQCTRL</name>
          <description>No Description</description>
          <addressOffset>0x068</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00001C07</resetMask>
          <fields>
            <field>
              <name>COMPACT</name>
              <description>STIMER Compare Action</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WRAP</name>
                  <description>STIMER wraps when reaching STIMERCOMP</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONTINUE</name>
                  <description>STIMER continues when reaching STIMERCOMP</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPINVALMODE</name>
              <description>STIMER Comp Invalid Mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NEVER</name>
                  <description>STIMERCOMP is always valid</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATECHANGE</name>
                  <description>STIMERCOMP is invalidated when the RSM changes state</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPEVENT</name>
                  <description>STIMERCOMP is invalidated when an STIMER compare event occurs</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATECOMP</name>
                  <description>STIMERCOMP is invalidated both when the RSM changes state and when a compare event occurs</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STIMERDEBUGRUN</name>
              <description>STIMER Debug Run</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>X0</name>
                  <description>STIMER is not running when the Sequencer is halted.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>X1</name>
                  <description>STIMER is running when the Sequencer is halted.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPUHALTREQEN</name>
              <description>CPU Halt Request Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>X0</name>
                  <description>Main CPU is not halted when the Sequencer is halted.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>X1</name>
                  <description>Main CPU is halted when the Sequencer is halted.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQHALTUPONCPUHALTEN</name>
              <description>Sequencer Halt Upon CPU Halt Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>X0</name>
                  <description>Sequencer is not halted when the main CPU is halted.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>X1</name>
                  <description>Sequencer is halted when the main CPU is halted.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PRESC</name>
          <description>No Description</description>
          <addressOffset>0x06C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000007</resetValue>
          <resetMask>0x0000007F</resetMask>
          <fields>
            <field>
              <name>STIMER</name>
              <description>STIMER Prescaler</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SR0</name>
          <description>No Description</description>
          <addressOffset>0x070</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SR0</name>
              <description>Sequencer Storage Register 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SR1</name>
          <description>No Description</description>
          <addressOffset>0x074</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SR1</name>
              <description>Sequencer Storage Register 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SR2</name>
          <description>No Description</description>
          <addressOffset>0x078</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SR2</name>
              <description>Sequencer Storage Register 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SR3</name>
          <description>No Description</description>
          <addressOffset>0x07C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SR3</name>
              <description>Sequencer Storage Register 3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNTHENCTRL</name>
          <description>No Description</description>
          <addressOffset>0x084</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00100282</resetMask>
          <fields>
            <field>
              <name>VCOSTARTUP</name>
              <description>SYVCOFASTSTARTUP</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>fast_start_up_0</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fast_start_up_1</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VCBUFEN</name>
              <description>SYLPFVCBUFEN</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPFBWSEL</name>
              <description>LPF bandwidth register selection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPFBWRX</name>
                  <description>Select LPFBWRX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPFBWTX</name>
                  <description>Select LPFBWTX</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNTHREGCTRL</name>
          <description>No Description</description>
          <addressOffset>0x088</addressOffset>
          <access>read-write</access>
          <resetValue>0x04000000</resetValue>
          <resetMask>0x07001C00</resetMask>
          <fields>
            <field>
              <name>MMDLDOVREFTRIM</name>
              <description>SYTRIMMMDREGVREF</description>
              <bitOffset>10</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>vref0p6000</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref0p6125</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref0p6250</name>
                  <description></description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref0p6375</name>
                  <description></description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref0p6500</name>
                  <description></description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref0p6625</name>
                  <description></description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref0p6750</name>
                  <description></description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref0p6875</name>
                  <description></description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHPLDOVREFTRIM</name>
              <description>SYTRIMCHPREGVREF</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>vref0p6000</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref0p6125</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref0p6250</name>
                  <description></description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref0p6375</name>
                  <description></description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref0p6500</name>
                  <description></description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref0p6625</name>
                  <description></description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref0p6750</name>
                  <description></description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref0p6875</name>
                  <description></description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>VCOCTRL</name>
          <description>No Description</description>
          <addressOffset>0x08C</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000004C</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>VCOAMPLITUDE</name>
              <description>SYVCOAMPLOPEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VCODETAMPLITUDE</name>
              <description>SYVCOAMPLPKD</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNTHCTRL</name>
          <description>No Description</description>
          <addressOffset>0x094</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000400</resetMask>
          <fields>
            <field>
              <name>MMDPOWERBALANCEDISABLE</name>
              <description>SYMMDPOWERBALANCEENB</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EnablePowerbleed</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DisablePowerBleed</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
