NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32BG21/EFR32BG21A020F1024IM32.svd
        <register>
          <name>FSMSTATUS</name>
          <description>No Description</description>
          <addressOffset>0x21C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000FFFFF</resetMask>
          <fields>
            <field>
              <name>DETSTATE</name>
              <description>Detection FSM state</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off state</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMINGSEARCH</name>
                  <description>Timing search</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESEARCH</name>
                  <description>Preamble search</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRAMESEARCH</name>
                  <description>Frame search</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXFRAME</name>
                  <description>Payload Detection</description>
                  <value>40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRAMEDETMODE0</name>
                  <description>Timing search with sliding window (FDM0)</description>
                  <value>50</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSASTATE</name>
              <description>Demodulator DSA FSM state</description>
              <bitOffset>7</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>IDLE state</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARRIVALCHK</name>
                  <description>Arrival Check</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATUSCHK</name>
                  <description>Status Check</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPPW</name>
                  <description>SAMP_PW</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAITPWRUP</name>
                  <description>WAIT_PWRUP</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAITDSALO</name>
                  <description>WAIT_DSALO</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAITABORT</name>
                  <description>WAIT_ABORT</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>STOP</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LRBLESTATE</name>
              <description>Demodulator long-range BLE FSM state</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>IDLE state</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEANUP</name>
                  <description>CLEANUP</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRCOE</name>
                  <description>CORRCOE</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAITLRDSA</name>
                  <description>WAIT_LR_DSA</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAXCORR</name>
                  <description>MAXCORR</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAITRDY</name>
                  <description>WAIT_RDY</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FEC1DATA</name>
                  <description>FEC1_DATA</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FEC1ACK</name>
                  <description>FEC1_ACK</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAUSE</name>
                  <description>PAUSE</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FEC2DATA</name>
                  <description>FEC2_DATA</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FEC2ACK</name>
                  <description>FEC2_ACK</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRACKCUR</name>
                  <description>TRACK_CUR</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRACKEAR</name>
                  <description>TRACK_EAR</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRACKLAT</name>
                  <description>TRACK_LAT</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRACKDONE</name>
                  <description>TRACK_DONE</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TDECISION</name>
                  <description>T_DECISION</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>STOP</description>
                  <value>16</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NBBLESTATE</name>
              <description>Demodulator Narrow-band BLE FSM state</description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>IDLE state</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VTINITI</name>
                  <description>VTINITI</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADDRNXT</name>
                  <description>ADDR_NXT</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INICOST</name>
                  <description>INI_COST</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CALCCOST</name>
                  <description>CALC_COST</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INITALACQU</name>
                  <description>INITAL_ACQU</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INITALCOSTCALC</name>
                  <description>INITAL_COST_CALC</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINCOSTCALC</name>
                  <description>MIN_COST_CALC</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREQACQU</name>
                  <description>FREQ_ACQU</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREQACQUDONE</name>
                  <description>FREQ_ACQU_DONE</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMINGACQUEARLY</name>
                  <description>TIMING_ACQU_EARLY</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMINGACQUCURR</name>
                  <description>TIMING_ACQU_CURR</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMINGACQULATE</name>
                  <description>TIMING_ACQU_LATE</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMINGACQUDONE</name>
                  <description>TIMING_ACQU_DONE</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VIRTBIINIT0</name>
                  <description>VIRTBI_INIT0</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VIRTBIINIT1</name>
                  <description>VIRTBI_INIT1</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VIRTBIRXSYNC</name>
                  <description>VIRTBI_RXSYNC</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VIRTBIRXPAYLOAD</name>
                  <description>VIRTBI_RXPAYLOAD</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HARDRXSYNC</name>
                  <description>HARD_RXSYNC</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HARDXPAYLOAD</name>
                  <description>HARD_RXPAYLOAD</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRACKFREQ</name>
                  <description>TRACK_FREQ</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRACKTIMEARLY</name>
                  <description>TRACK_TIM_EARLY</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRACKTIMCURR</name>
                  <description>TRACK_TIM_CURR</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRACKTIMLATE</name>
                  <description>TRACK_TIM_LATE</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRACKDONE</name>
                  <description>TRACK_DONE</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRACKDECISION</name>
                  <description>TRACK_DECISION</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>STOP</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAITACK</name>
                  <description>WAIT_ACK</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBUG</name>
                  <description>DEBUG</description>
                  <value>28</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS2</name>
          <description>No Description</description>
          <addressOffset>0x220</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00003FFF</resetMask>
          <fields>
            <field>
              <name>CHPWRACCUMUX</name>
              <description>Channel power</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BBSSMUX</name>
              <description>Actual Baseband Signal Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LRBLECI</name>
              <description>RXed packet's LR BLE coding indicator</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LR125k</name>
                  <description>FEC block 2 coded using C=8, 125kbps</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LR500k</name>
                  <description>FEC block 2 coded using C=2, 500kbps</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS3</name>
          <description>No Description</description>
          <addressOffset>0x224</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x07FFFFFF</resetMask>
          <fields>
            <field>
              <name>BBPFOUTABS1</name>
              <description>Pre-filter Correlation Output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BBPFOUTABS</name>
              <description>Pre-filter Correlation Output for BLR</description>
              <bitOffset>11</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LRDSALIVE</name>
              <description>BLRDSA Prefilter above LRSPIKETHD</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COHDSALIVE</name>
              <description>COHDSA Prefilter above CDTH</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LRDSADET</name>
              <description>DSA prefilter above LRSPIKETHD</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COHDSADET</name>
              <description>DSA prefilter above CDTH</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SYNCSECPEAKABTH</name>
              <description>SYNC second peak above threshold</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRCAL</name>
          <description>No Description</description>
          <addressOffset>0x228</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00003FBF</resetMask>
          <fields>
            <field>
              <name>IRCALEN</name>
              <description>IRCAL enable bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MURSHF</name>
              <description>MUR shift value</description>
              <bitOffset>1</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUISHF</name>
              <description>MUI shift value</description>
              <bitOffset>7</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IRCORREN</name>
              <description>IR Correction enable bit</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRCALCOEF</name>
          <description>No Description</description>
          <addressOffset>0x22C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7FFF7FFF</resetMask>
          <fields>
            <field>
              <name>CRV</name>
              <description>CRV coefficient</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CIV</name>
              <description>CIV coefficient</description>
              <bitOffset>16</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLEIQDSA</name>
          <description>No Description</description>
          <addressOffset>0x230</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BLEIQDSAEN</name>
              <description>BLEIQDSA Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLEIQDSATH</name>
              <description>BLEIQDSA Threshold</description>
              <bitOffset>1</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLEIQDSAIIRCOEFPWR</name>
              <description>BLEIQDSA IIRCOEFPWR</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLEIQDSADIFFTH1</name>
              <description>BLEIQDSA BLEIQDSADIFFTH1</description>
              <bitOffset>18</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
